In [9]:
import numpy as np
import pandas as pd
stuff = {
  'corporation': ['Apple', "google", 'Meta',"Apple"],
  "employees":["john","april","aviral","steph"],
  "salary":[25,45,100,12]}
my_df = pd.DataFrame(stuff)
my_df

  corporation employees  salary
0       Apple      john      25
1      google     april      45
2        Meta    aviral     100
3       Apple     steph      12

In [10]:
# create function
def times1000(x):
  return format(x *1000,',d')

In [11]:
# use apply functions
my_df['salary'].apply(times1000)

0     25,000
1     45,000
2    100,000
3     12,000
Name: salary, dtype: object

In [12]:
# make it into a data frame
pd.DataFrame(my_df['salary'].apply(times1000))

    salary
0   25,000
1   45,000
2  100,000
3   12,000

In [13]:
# add elder last name
def name(x):
  if x=="aviral":
    return "aviral mittal"
  else:
    return x

In [15]:
# show
my_df['employees'].apply(name)

0             john
1            april
2    aviral mittal
3            steph
Name: employees, dtype: object